In [13]:
import pandas as pd

In [16]:
s = pd.Series()

In [17]:
s['Ilya'] = 27
s['Vladimir'] = 52

In [14]:
df = pd.DataFrame()

In [19]:
df['age'] = s

In [21]:
df['married'] = ['no', 'yes']
df

          age married
Ilya       27      no
Vladimir   52     yes

In [27]:
df.loc['Andrew'] = [30, 'yes']

In [29]:
df['city'] = ['Saint-Petersburg', 'Moscow', 'Tuymen']

In [31]:
df.loc['Maria'] = [25, 'no', 'Sochi']

In [36]:
df.loc['Vladimir':'Andrew', 'age':'married']

          age married
Vladimir   52     yes
Andrew     30     yes

In [52]:
df

          age married              city
Ilya       27      no  Saint-Petersburg
Vladimir   52     yes            Moscow
Andrew     30     yes            Tuymen
Maria      25      no             Sochi

In [69]:
df.iloc[1:3, 1:]

         married    city
Vladimir     yes  Moscow
Andrew       yes  Tuymen

In [70]:
df.loc['Vladimir':'Andrew', 'age':'married']

          age married
Vladimir   52     yes
Andrew     30     yes